BasaDip/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <predefined>
    <items>
      <name>EMailКонтрагента</name>
      <description>E mail контрагента</description>
    </items>
    <items>
      <name>ПочтовыйАдресКонтрагента</name>
      <description>Почтовый адрес контрагента</description>
    </items>
    <items>
      <name>ТелефонКонтрагента</name>
      <description>Телефон контрагента</description>
    </items>
    <items>
      <name>ФактическийАдресКонтрагента</name>
      <description>Фактический адрес контрагента</description>
    </items>
    <items>
      <name>ЮридическийАдресКонтрагента</name>
      <description>Юридический адрес контрагента</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
</mdclass:Catalog>

BasaDip/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>EMail</name>
  </enumValues>
</mdclass:Enum>

BasaDip/src/Catalogs/ВидыКонтактнойИнформации/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	
	Телефон = ТелефонКонтрагента.ПолучитьОбъект();
	Телефон.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	Телефон.Записать();
	
	EMail = EMailКонтрагента.ПолучитьОбъект();
	EMail.Тип = Перечисления.ТипыКонтактнойИнформации.EMail;
	EMail.Записать();
	
	АдресФактический = ФактическийАдресКонтрагента.ПолучитьОбъект();
	АдресФактический.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	АдресФактический.Записать();
	 
	АдресЮридический = ЮридическийАдресКонтрагента.ПолучитьОбъект();
	АдресЮридический.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	АдресЮридический.Записать();
	
	АдресПочтовый = ПочтовыйАдресКонтрагента.ПолучитьОбъект();
	АдресПочтовый.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	АдресПочтовый.Записать();

КонецПроцедуры

#КонецОбласти
